const arr = [
    generate("Виктория","Баринова","12.09.2005",4),
    generate("Давлятова","Мехрангез","10.07.2005",5),
    generate("Ерешкова","Алёна","28.04.2005",5),
    generate("Жильцов","Артём","13.05.2005",4),
    generate("Ильина","Виктория","15.07.2005",5),
    generate("Кабанова","Ксения","20.02.2005",5),
    generate("Климов","Максим","12.08.2005",5),
    generate("Кокарева","Ольга","15.12.2004",4),
    generate("Ларионов","Николай","5.01.2005",4),
    generate("Макаров","Иван","6.07.2005",5),
    generate("Миронов","Данила","7.06.2005",4),
    generate("Павлов","Данил","14.03.2005",5),
    generate("Панфиленко","Тимофей","14.09.2005",5),
    generate("Пепеляев","Кирилл","09.06.2005",4),
    generate("Самусева","Диана","29.05.2005",4),
    generate("Семенищев","Никита","25.09.2005",5),
    generate("Солодов","Антон","09.04.2005"),4,
    generate("Спрыгин","Артём","05.02.2005",5),
    generate("Тихомиров","Никита","12.04.2005"),
    generate("Трухмаев","Андрей","07.12.2005",5),
    generate("Шлыкова","Дарья","18.10.2005",5),
    generate("Шушунова","Виктория","03.08.2005",4),
];

function generate(name,surname,date,mark=5) {
  return {
    name:name,
    surname:surname,
    date:date,
    year:"2021",
    kurs:"2",
    group:"ИСП",
    mark:mark
}  
}
console.log(arr)